# GetProcessingResult Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailuresProcessingEventArgs..::..GetProcessingResult Method
FailuresProcessingEventArgs Class See Also
---
Retrieves current status of the failures processing result.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureProcessingResult GetProcessingResult()
```

Visual Basic
---
```text
Public Function GetProcessingResult As FailureProcessingResult
```

Visual C++
---
```text
public:
FailureProcessingResult GetProcessingResult()
```

# ### Return Value
The current failures processing result.
# See Also
FailuresProcessingEventArgs Class
Autodesk.Revit.DB.Events Namespace